KnDokusei/PROYECTO_IOT_TUBO/EC-Cameras/sdkconfig.defaults
# Target: AI-Thinker ESP32-CAM. El módulo dice "ESP32-S" en la serigrafía, que
# es el ESP32 clásico de dos núcleos Xtensa, no un ESP32-S2 ni un S3.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# La AI-Thinker ESP32-CAM lleva 4 MB de PSRAM, que el driver de la cámara
# necesita para cualquier resolución por encima de QVGA con dos búferes.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# El binario con el driver de cámara no cabe en la partición de 1 MB que traen
# las tablas por defecto.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Labfisica no anuncia su SSID. Esta opción permite conectar a APs ocultos
# mediante escaneo pasivo cuando la política de país es automática; viene
# desactivada de fábrica.
CONFIG_ESP_WIFI_PASSIVE_HIDDEN_AP_SUPPORT=y

# El servidor HTTP sostiene la conexión del stream mientras haya cliente.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
